luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_regdef.h
/** \brief  Common Mode Hold Voltage Register 2 */
typedef struct _Ifx_DSADC_GLOBVCMH2_Bits
{
    unsigned int reserved_0:29;             /**< \brief \internal Reserved */
    unsigned int VHON:1;                    /**< \brief [29:29] Common Mode Hold Voltage On (rw) */
    unsigned int VCMHS:2;                   /**< \brief [31:30] Common Mode Hold Voltage Selection (rw) */
} Ifx_DSADC_GLOBVCMH2_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_DSADC_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_DSADC_ID_Bits;

/** \brief  Kernel Reset Register 0 */
typedef struct _Ifx_DSADC_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRST0_Bits;

/** \brief  Kernel Reset Register 1 */
typedef struct _Ifx_DSADC_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRST1_Bits;

/** \brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_DSADC_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRSTCLR_Bits;

/** \brief  OCDS Control and Status Register */
typedef struct _Ifx_DSADC_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_DSADC_OCS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dsadc_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_ACCEN0_Bits B;                /**< \brief Bitfield access */
} Ifx_DSADC_ACCEN0;

/** \brief  Access Protection Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_ACCPROT_Bits B;               /**< \brief Bitfield access */
} Ifx_DSADC_ACCPROT;

/** \brief  Carrier Generator Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CGCFG_Bits B;                 /**< \brief Bitfield access */
} Ifx_DSADC_CGCFG;

/** \brief  Boundary Select Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_BOUNDSEL_Bits B;           /**< \brief Bitfield access */
} Ifx_DSADC_CH_BOUNDSEL;

/** \brief  Carrier Generator Synchronization Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_CGSYNC_Bits B;             /**< \brief Bitfield access */
} Ifx_DSADC_CH_CGSYNC;

/** \brief  Demodulator Input Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_DICFG_Bits B;              /**< \brief Bitfield access */
} Ifx_DSADC_CH_DICFG;

/** \brief  Filter Configuration Register, Auxiliary Filter */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_FCFGA_Bits B;              /**< \brief Bitfield access */
} Ifx_DSADC_CH_FCFGA;

/** \brief  Filter Configuration Register, Main CIC Filter */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_FCFGC_Bits B;              /**< \brief Bitfield access */
} Ifx_DSADC_CH_FCFGC;

/** \brief  Filter Configuration Register, Main Filter Chain */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_FCFGM_Bits B;              /**< \brief Bitfield access */
} Ifx_DSADC_CH_FCFGM;

/** \brief  Integration Window Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_IWCTR_Bits B;              /**< \brief Bitfield access */
} Ifx_DSADC_CH_IWCTR;

/** \brief  Modulator Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_MODCFG_Bits B;             /**< \brief Bitfield access */
} Ifx_DSADC_CH_MODCFG;

/** \brief  Offset Register Main Filter */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_OFFM_Bits B;               /**< \brief Bitfield access */
} Ifx_DSADC_CH_OFFM;

/** \brief  Rectification Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_RECTCFG_Bits B;            /**< \brief Bitfield access */
} Ifx_DSADC_CH_RECTCFG;

/** \brief  Result Register Auxiliary Filter */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_RESA_Bits B;               /**< \brief Bitfield access */
} Ifx_DSADC_CH_RESA;

