luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_regdef.h
/** \brief  Result Register Main Filter */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_RESM_Bits B;               /**< \brief Bitfield access */
} Ifx_DSADC_CH_RESM;

/** \brief  Time-Stamp Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CH_TSTMP_Bits B;              /**< \brief Bitfield access */
} Ifx_DSADC_CH_TSTMP;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_CLC_Bits B;                   /**< \brief Bitfield access */
} Ifx_DSADC_CLC;

/** \brief  Event Flag Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_EVFLAG_Bits B;                /**< \brief Bitfield access */
} Ifx_DSADC_EVFLAG;

/** \brief  Event Flag Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_EVFLAGCLR_Bits B;             /**< \brief Bitfield access */
} Ifx_DSADC_EVFLAGCLR;

/** \brief  Global Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_GLOBCFG_Bits B;               /**< \brief Bitfield access */
} Ifx_DSADC_GLOBCFG;

/** \brief  Global Run Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_GLOBRC_Bits B;                /**< \brief Bitfield access */
} Ifx_DSADC_GLOBRC;

/** \brief  Common Mode Hold Voltage Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_GLOBVCMH0_Bits B;             /**< \brief Bitfield access */
} Ifx_DSADC_GLOBVCMH0;

/** \brief  Common Mode Hold Voltage Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_GLOBVCMH1_Bits B;             /**< \brief Bitfield access */
} Ifx_DSADC_GLOBVCMH1;

/** \brief  Common Mode Hold Voltage Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_GLOBVCMH2_Bits B;             /**< \brief Bitfield access */
} Ifx_DSADC_GLOBVCMH2;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_ID_Bits B;                    /**< \brief Bitfield access */
} Ifx_DSADC_ID;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_KRST0_Bits B;                 /**< \brief Bitfield access */
} Ifx_DSADC_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_KRST1_Bits B;                 /**< \brief Bitfield access */
} Ifx_DSADC_KRST1;

/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_KRSTCLR_Bits B;               /**< \brief Bitfield access */
} Ifx_DSADC_KRSTCLR;

/** \brief  OCDS Control and Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DSADC_OCS_Bits B;                   /**< \brief Bitfield access */
} Ifx_DSADC_OCS;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dsadc_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  Channel objects */
typedef volatile struct _Ifx_DSADC_CH
{
    Ifx_DSADC_CH_MODCFG MODCFG;             /**< \brief 0, Modulator Configuration Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_DSADC_CH_DICFG DICFG;               /**< \brief 8, Demodulator Input Configuration Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_DSADC_CH_FCFGM FCFGM;               /**< \brief 10, Filter Configuration Register, Main Filter Chain */
    Ifx_DSADC_CH_FCFGC FCFGC;               /**< \brief 14, Filter Configuration Register, Main CIC Filter */
    Ifx_DSADC_CH_FCFGA FCFGA;               /**< \brief 18, Filter Configuration Register, Auxiliary Filter */
    unsigned char reserved_1C[4];           /**< \brief 1C, \internal Reserved */
    Ifx_DSADC_CH_IWCTR IWCTR;               /**< \brief 20, Integration Window Control Register */
    unsigned char reserved_24[4];           /**< \brief 24, \internal Reserved */
    Ifx_DSADC_CH_BOUNDSEL BOUNDSEL;         /**< \brief 28, Boundary Select Register */
    unsigned char reserved_2C[4];           /**< \brief 2C, \internal Reserved */
    Ifx_DSADC_CH_RESM RESM;                 /**< \brief 30, Result Register Main Filter */
    unsigned char reserved_34[4];           /**< \brief 34, \internal Reserved */
    Ifx_DSADC_CH_OFFM OFFM;                 /**< \brief 38, Offset Register Main Filter */
    unsigned char reserved_3C[4];           /**< \brief 3C, \internal Reserved */
    Ifx_DSADC_CH_RESA RESA;                 /**< \brief 40, Result Register Auxiliary Filter */
    unsigned char reserved_44[12];          /**< \brief 44, \internal Reserved */
    Ifx_DSADC_CH_TSTMP TSTMP;               /**< \brief 50, Time-Stamp Register */
    unsigned char reserved_54[76];          /**< \brief 54, \internal Reserved */
    Ifx_DSADC_CH_CGSYNC CGSYNC;             /**< \brief A0, Carrier Generator Synchronization Register */
    unsigned char reserved_A4[4];           /**< \brief A4, \internal Reserved */
    Ifx_DSADC_CH_RECTCFG RECTCFG;           /**< \brief A8, Rectification Configuration Register */
    unsigned char reserved_AC[84];          /**< \brief AC, \internal Reserved */
} Ifx_DSADC_CH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dsadc_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  DSADC object */
typedef volatile struct _Ifx_DSADC
{
    Ifx_DSADC_CLC CLC;                      /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_DSADC_ID ID;                        /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[28];           /**< \brief C, \internal Reserved */
    Ifx_DSADC_OCS OCS;                      /**< \brief 28, OCDS Control and Status Register */
    Ifx_DSADC_KRSTCLR KRSTCLR;              /**< \brief 2C, Kernel Reset Status Clear Register */
    Ifx_DSADC_KRST1 KRST1;                  /**< \brief 30, Kernel Reset Register 1 */
    Ifx_DSADC_KRST0 KRST0;                  /**< \brief 34, Kernel Reset Register 0 */
    unsigned char reserved_38[4];           /**< \brief 38, \internal Reserved */
    Ifx_DSADC_ACCEN0 ACCEN0;                /**< \brief 3C, Access Enable Register 0 */
    unsigned char reserved_40[64];          /**< \brief 40, \internal Reserved */
    Ifx_DSADC_GLOBCFG GLOBCFG;              /**< \brief 80, Global Configuration Register */
    unsigned char reserved_84[4];           /**< \brief 84, \internal Reserved */
    Ifx_DSADC_GLOBRC GLOBRC;                /**< \brief 88, Global Run Control Register */
    unsigned char reserved_8C[4];           /**< \brief 8C, \internal Reserved */
    Ifx_DSADC_ACCPROT ACCPROT;              /**< \brief 90, Access Protection Register */
    unsigned char reserved_94[12];          /**< \brief 94, \internal Reserved */
    Ifx_DSADC_CGCFG CGCFG;                  /**< \brief A0, Carrier Generator Configuration Register */
    unsigned char reserved_A4[12];          /**< \brief A4, \internal Reserved */
    Ifx_DSADC_GLOBVCMH0 GLOBVCMH0;          /**< \brief B0, Common Mode Hold Voltage Register 0 */
    Ifx_DSADC_GLOBVCMH1 GLOBVCMH1;          /**< \brief B4, Common Mode Hold Voltage Register 1 */
    Ifx_DSADC_GLOBVCMH2 GLOBVCMH2;          /**< \brief B8, Common Mode Hold Voltage Register 2 */
    unsigned char reserved_BC[36];          /**< \brief BC, \internal Reserved */
    Ifx_DSADC_EVFLAG EVFLAG;                /**< \brief E0, Event Flag Register */
    Ifx_DSADC_EVFLAGCLR EVFLAGCLR;          /**< \brief E4, Event Flag Clear Register */
    unsigned char reserved_E8[24];          /**< \brief E8, \internal Reserved */
    Ifx_DSADC_CH CH[6];                     /**< \brief 100, Channel objects */
    unsigned char reserved_700[2304];       /**< \brief 700, \internal Reserved */
} Ifx_DSADC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDSADC_REGDEF_H */
